FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_EMAC.c
    idx = TxProduceIndex;
    TX_DESC_CTRL(idx) = (aFrameSize-1) | TCTRL_LAST; /*Corrected problem with the size, -1 was missing*/
    if (++idx == NUM_TX_FRAG)
        idx = 0;
    TxProduceIndex = idx;
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC2478_WriteTxFrameData
 *---------------------------------------------------------------------------*
 * Description:
 *      Writes a word in little-endian byte order to TX_BUFFER
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      TUInt16 aData               -- Data to write
 *---------------------------------------------------------------------------*/
static void ILPC2478_WriteTxFrameData(T_LPC2478_EMAC_Workspace *p, TUInt16 aData)
{
    *(p->tptr++) = aData;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_EMAC_CopyToFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from MCU-memory to frame port
 *      NOTES:
 *        - an odd number of byte may only be transfered
 *                  if the frame is written to the end!
 *        - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aSource               -- Location of data to send
 *      TUInt32 aSize               -- Number of bytes to send
 *---------------------------------------------------------------------------*/
void LPC2478_EMAC_CopyToFrame(
            void *aWorkspace,
            void *aSource,
            TUInt32 aSize)
{
    T_LPC2478_EMAC_Workspace *p = (T_LPC2478_EMAC_Workspace *)aWorkspace;
    TUInt16 *piSource;

    piSource = aSource;
    aSize = (aSize + 1) & 0xFFFE;    // round Size up to next even number
    while (aSize > 0) {
        ILPC2478_WriteTxFrameData(p, *piSource++);
        aSize -= 2;
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC2478_ReadRxFrameData
 *---------------------------------------------------------------------------*
 * Description:
 *      Reads a word in little-endian byte order from RX_BUFFER
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 * Outputs:
 *      TUInt16 aData               -- Data read
 *---------------------------------------------------------------------------*/
TUInt16 ILPC2478_ReadRxFrameData(T_LPC2478_EMAC_Workspace *p)
{
    return (*(p->rptr++));
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_EMAC_CopyFromFrame
 *---------------------------------------------------------------------------*
 * Description:
 *      Copies bytes from frame port to MCU-memory
 *      NOTES:
 *          - an odd number of byte may only be transfered
 *              if the frame is read to the end!
 *          - MCU-memory MUST start at word-boundary
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      void *aDestination          -- Location to store data
 *      TUInt32 aSize               -- Number of bytes to copy
 *---------------------------------------------------------------------------*/
void LPC2478_EMAC_CopyFromFrame(
                void *aWorkspace,
                void *aDestination,
                TUInt32 aSize)
{
    T_LPC2478_EMAC_Workspace *p = (T_LPC2478_EMAC_Workspace *)aWorkspace;
    // Keil: Pointer added to correct expression
    TUInt16 *piDest;

    // Keil: Line added
    piDest = aDestination;
    while (aSize > 1) {
        *piDest++ = ILPC2478_ReadRxFrameData(p);
        aSize -= 2;
    }

    // check for leftover byte...
    if (aSize) {
        // the LAN-Controller will return 0 for the highbyte
        *(TUInt8 *)piDest = (TUInt8)ILPC2478_ReadRxFrameData(p);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_EMAC_ProcessInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      An interrupt on this EMAC has been received.  Catch it and
 *      possible pass it on to a callback routine.
 *---------------------------------------------------------------------------*/
static void LPC2478_EMAC_ProcessInterrupt(void)
{
    T_LPC2478_EMAC_Workspace *p = G_LPC2478_EMAC;
    TUInt32 status;

    // Clear the interrupt.
    status = IntStatus;
    if (status & EMAC_INT_RXDONE) {
        if (p->iReceiveCallback) {
            p->iReceiveCallback(p->iReceiveCallbackWorkspace);
        }
    }
    // Clear any interrupts that triggered this code
    IntClear = status;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_EMAC_ISR
 *---------------------------------------------------------------------------*
 * Description:
 *      Stub to catch a EMAC interrupt.
 *---------------------------------------------------------------------------*/
IRQ_ROUTINE(LPC2478_EMAC_ISR)
{
    IRQ_START();
    LPC2478_EMAC_ProcessInterrupt();
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_EMAC_EnableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Enable interrupts to occur when packets are received by the EMAC
 *      instead of just polling for the data.  The given callback routine
 *      will be called per interrupt.  The callback routine is called
 *      from withing the interrupt routine, so it should merely set
 *      a flag, release a semaphore, or any other minimal processing, and
 *      return quickly.
 * Inputs:
 *      void *aWorkspace            -- EMAC Controller's workspace
 *      T_uezEMACReceiveInterruptCallback aCallback -- Routine to call on
 *          interrupts.  Can be set to 0 for no processing.
 *      void *aCallbackWorkspace -- Workspace pointer to pass to callback
 *          or 0 for none.
 *---------------------------------------------------------------------------*/
void LPC2478_EMAC_EnableReceiveInterrupt(
    void *aWorkspace,
    T_uezEMACReceiveInterruptCallback aCallback,
    void *aCallbackWorkspace)
{
    T_LPC2478_EMAC_Workspace *p = (T_LPC2478_EMAC_Workspace *)aWorkspace;

    p->iReceiveCallback = aCallback;
    p->iReceiveCallbackWorkspace = aCallbackWorkspace;
    // Register this interrupt (if not already)
    InterruptRegister(INTERRUPT_CHANNEL_ETHERNET, (TISRFPtr)LPC2478_EMAC_ISR,
        INTERRUPT_PRIORITY_HIGH, "EMAC");
    InterruptEnable(INTERRUPT_CHANNEL_ETHERNET);
    // Turn on those types of interrupts
    IntEnable = INT_RX_DONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_EMAC_DisableReceiveInterrupt
 *---------------------------------------------------------------------------*
 * Description:
 *      Disables receive interrupts from the EMAC.
 *---------------------------------------------------------------------------*/
void LPC2478_EMAC_DisableReceiveInterrupt(void *aWorkspace)
{
    // Turn off those types of interrupts
    IntClear = INT_RX_DONE;
    // Turn off the whole interrutp since it is the only one
    InterruptEnable(INTERRUPT_CHANNEL_ETHERNET);
}


/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_EMAC_RMII_Require(const T_LPC2478_EMAC_Settings *aSettings)
{
    T_LPC2478_EMAC_Workspace *p;
    static const T_LPC2478_PINSEL_ConfigList pinsTX_EN[] = {
            {GPIO_P1_4,  1}, // ENET_TX_EN
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTXD3[] = {
            {GPIO_P1_3,  1}, // ENET_TXD[3]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTXD2[] = {
            {GPIO_P1_2,  1}, // ENET_TXD[2]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTXD1[] = {
            {GPIO_P1_1,  1}, // ENET_TXD[1]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTXD0[] = {
            {GPIO_P1_0,  1}, // ENET_TXD[0]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTX_ER[] = {
            {GPIO_P1_5,  1}, // ENET_TX_ER
    };
    static const T_LPC2478_PINSEL_ConfigList pinsTX_CLK[] = {
            {GPIO_P1_6,  1}, // ENET_TX_CLK
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRX_DV[] = {
            {GPIO_P1_13, 1}, // ENET_RX_DV
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRXD3[] = {
            {GPIO_P1_12, 1}, // ENET_RXD[3]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRXD2[] = {
            {GPIO_P1_11, 1}, // ENET_RXD[2]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRXD1[] = {
            {GPIO_P1_10, 1}, // ENET_RXD[1]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRXD0[] = {
            {GPIO_P1_9,  1}, // ENET_RXD[0]
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRX_ER[] = {
            {GPIO_P1_14, 1}, // ENET_RX_ER
    };
    static const T_LPC2478_PINSEL_ConfigList pinsRX_CLK[] = {
            {GPIO_P1_15, 1}, // ENET_RX_CLK
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCOL[] = {
            {GPIO_P1_7,  1}, // ENET_COL
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCRS[] = {
            {GPIO_P1_8,  1}, // ENET_CRS
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMDC[] = {
            {GPIO_P1_16, 1}, // ENET_MDC
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMDIO[] = {
            {GPIO_P1_17, 1}, // ENET_MDIO
    };
    HAL_DEVICE_REQUIRE_ONCE();

    // Register EMAC
    HALInterfaceRegister("EMAC", (T_halInterface *)&G_LPC2478_EMAC_Interface,
            0, (T_halWorkspace **)&p);
    p->iPinSettings = *aSettings;
    LPC2478_PINSEL_ConfigPin(aSettings->iTX_EN, pinsTX_EN,
            ARRAY_COUNT(pinsTX_EN));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTXD3, pinsTXD3,
            ARRAY_COUNT(pinsTXD3));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTXD2, pinsTXD2,
            ARRAY_COUNT(pinsTXD2));
    LPC2478_PINSEL_ConfigPin(aSettings->iTXD1, pinsTXD1, ARRAY_COUNT(pinsTXD1));
    LPC2478_PINSEL_ConfigPin(aSettings->iTXD0, pinsTXD0, ARRAY_COUNT(pinsTXD0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_ER, pinsTX_ER,
            ARRAY_COUNT(pinsTX_ER));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iTX_CLK, pinsTX_CLK,
            ARRAY_COUNT(pinsTX_CLK));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRX_DV, pinsRX_DV,
            ARRAY_COUNT(pinsRX_DV));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRXD3, pinsRXD3,
            ARRAY_COUNT(pinsRXD3));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iRXD2, pinsRXD2,
            ARRAY_COUNT(pinsRXD2));
    LPC2478_PINSEL_ConfigPin(aSettings->iRXD1, pinsRXD1, ARRAY_COUNT(pinsRXD1));
    LPC2478_PINSEL_ConfigPin(aSettings->iRXD0, pinsRXD0, ARRAY_COUNT(pinsRXD0));
    LPC2478_PINSEL_ConfigPin(aSettings->iRX_ER, pinsRX_ER,
            ARRAY_COUNT(pinsRX_ER));
    LPC2478_PINSEL_ConfigPin(aSettings->iRX_CLK, pinsRX_CLK,
            ARRAY_COUNT(pinsRX_CLK));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCOL, pinsCOL,
            ARRAY_COUNT(pinsCOL));
    LPC2478_PINSEL_ConfigPin(aSettings->iCRS, pinsCRS, ARRAY_COUNT(pinsCRS));
    LPC2478_PINSEL_ConfigPin(aSettings->iMDC, pinsMDC, ARRAY_COUNT(pinsMDC));
    LPC2478_PINSEL_ConfigPin(aSettings->iMDIO, pinsMDIO, ARRAY_COUNT(pinsMDIO));

#if EMAC_USE_BITBANG_MDIO_DETECT
    p->iMDIOSettings.iDelayUSPerHalfBit = EMAC_BITBANG_MDIO_DELAY_US;
    p->iMDIOSettings.iIsClause45 = EFalse;
    p->iMDIOSettings.iPinMDC = aSettings->iMDC;
    p->iMDIOSettings.iPinMDIO = aSettings->iMDIO;
    if (LPC2478_EMAC_DetectEMAC(p) == UEZ_ERROR_NONE)
        p->iIsDetected = ETrue;
#else
    p->iIsDetected = ETrue;
#endif
}

/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_EMAC G_LPC2478_EMAC_Interface = {
    "LPC2478 EMAC",
    0x0100,
    LPC2478_EMAC_InitializeWorkspace,
    sizeof(T_LPC2478_EMAC_Workspace),

    LPC2478_EMAC_Configure,
    LPC2478_EMAC_CheckFrameReceived,
    LPC2478_EMAC_StartReadFrame,
    LPC2478_EMAC_EndReadFrame,
    LPC2478_EMAC_RequestSend,
    LPC2478_EMAC_DoSend,
    LPC2478_EMAC_CopyToFrame,
    LPC2478_EMAC_CopyFromFrame,
    
    // v1.10
    LPC2478_EMAC_EnableReceiveInterrupt,
    LPC2478_EMAC_DisableReceiveInterrupt,
};

/*-------------------------------------------------------------------------*
 * End of File:  EMAC.c
 *-------------------------------------------------------------------------*/
